---
kind: property
id: P:Autodesk.Revit.DB.Architecture.CutMarkType.CutLineAngle
source: html/df935a4d-6daa-4008-958f-63a2df78f8a1.htm
---
# Autodesk.Revit.DB.Architecture.CutMarkType.CutLineAngle Property

The rotation angle of the cut mark.

## Syntax (C#)
```csharp
public double CutLineAngle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The given value for rotationAngle is not finite